
titles = [
    #"15元毛巾评测",
    #"快手爆款：10分钟学会糖醋里脊做法",
    #"农村老家的晚霞太美了，带你看看今天的天空", # <|sid_begin|><s_a_1371><s_b_4120><s_c_7314><|sid_end|>
    #"街头魔术挑战：30秒让路人猜不透", # <|sid_begin|><s_a_802><s_b_7825><s_c_3919><|sid_end|>
    #"健身小白一周打卡记录，看看变化有多大",
    #"一起听老歌：90年代经典情歌合集",
    
    "1月24日(土) 岐阜県の明日の天気",
    "【ガスト】何度でも最大120円引き！公式Xで最新クーポン公開《2月11日まで》",
    "夫婦喧嘩は無視＋経済制裁！「反省した？」ついに口を開いた夫が予想外の提案＜偏差値夫との赤点生活＞",
    "《2026衆院選》参政新人斎藤氏、出馬表明　茨城3区",
    "寒天で作る豆花(トーファ)",
    "日本海側では大雪　強い冷え込み続く",
    "ニッパツ、世界初のEV駆動向け樹脂絶縁の金属基板を量産化…デンソーが新型インバーターに採用",
    "【2026年版】三田市と近隣地域の開店・閉店・リニューアル情報まとめ(随時更新中)",
    "【シロヤ】冷凍でも美味しい！【サニーパン】",
    "どんなに金持って成功してても「独身」なら負けよな",
]

## normalized
results = [
    "<|sid_begin|><s_a_2345><s_b_5195><s_c_6071><|sid_end|>",
    "<|sid_begin|><s_a_4200><s_b_5195><s_c_5374><|sid_end|>",
    "<|sid_begin|><s_a_6784><s_b_3899><s_c_4479><|sid_end|>",
    "<|sid_begin|><s_a_5051><s_b_1081><s_c_6665><|sid_end|>",
    "<|sid_begin|><s_a_2055><s_b_2412><s_c_5711><|sid_end|>",
    "<|sid_begin|><s_a_5092><s_b_1317><s_c_2477><|sid_end|>",
    "<|sid_begin|><s_a_2610><s_b_5195><s_c_4777><|sid_end|>",
    "<|sid_begin|><s_a_2610><s_b_4652><s_c_1563><|sid_end|>",
    "<|sid_begin|><s_a_2610><s_b_215><s_c_2477><|sid_end|>",
    "<|sid_begin|><s_a_4353><s_b_7599><s_c_7360><|sid_end|>",
]

## unnormalized
results = [
    "<|sid_begin|><s_a_4883><s_b_1638><s_c_3301><|sid_end|>",
    "<|sid_begin|><s_a_4200><s_b_1638><s_c_3301><|sid_end|>",
    "<|sid_begin|><s_a_6784><s_b_5514><s_c_3686><|sid_end|>",
    "<|sid_begin|><s_a_1047><s_b_3858><s_c_3301><|sid_end|>",
    "<|sid_begin|><s_a_992><s_b_1638><s_c_5241><|sid_end|>",
    "<|sid_begin|><s_a_2779><s_b_3858><s_c_3226><|sid_end|>",
    "<|sid_begin|><s_a_3808><s_b_1638><s_c_3507><|sid_end|>",
    "<|sid_begin|><s_a_6812><s_b_1638><s_c_3301><|sid_end|>",
    "<|sid_begin|><s_a_4057><s_b_1638><s_c_5241><|sid_end|>",
    "<|sid_begin|><s_a_2889><s_b_3858><s_c_3226><|sid_end|>",
]